internalCRM/src/main/java/fr/univ/angers/requests/request2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ws="http://ws-crm">
    <soapenv:Header/>
    <soapenv:Body>
        <ws:findLeadsByDateRequest>
            <ws:startDate>2021-05-10</ws:startDate>
            <ws:endDate>2021-05-30</ws:endDate>
        </ws:findLeadsByDateRequest>
    </soapenv:Body>
</soapenv:Envelope>